## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.sqs-send-sms-high-queue-delay-critical`   |
|        | `aws_cloudwatch_metric_alarm.sqs-send-sms-high-queue-delay-warning`    |
|        | `aws_cloudwatch_metric_alarm.sqs-send-sms-low-queue-critical`          |
|        | `aws_cloudwatch_metric_alarm.sqs-send-sms-low-queue-warning`           |
|        | `aws_cloudwatch_metric_alarm.sqs-send-sms-medium-queue-delay-critical` |
|        | `aws_cloudwatch_metric_alarm.sqs-send-sms-medium-queue-delay-warning`  |
|        | `module.athena_logs_bucket.aws_s3_bucket_versioning.this`              |
|        | `module.csv_bucket_logs.aws_s3_bucket_versioning.this`                 |
|        | `module.document_download_logs.aws_s3_bucket_versioning.this`          |
| update | `aws_cloudwatch_dashboard.sensitive`                                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.sensitive will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "sensitive" {
      ~ dashboard_body = jsonencode(
          ~ {
              - start   = "-PT168H" -> null
              ~ widgets = [
                  ~ {
                      ~ properties = {
                          ~ query   = <<-EOT
                                SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp, log
                                | filter kubernetes.container_name like /admin/
                                | filter log like /Sensitive/
                                | filter log like /\/service\/[0-9a-f\-]{36}\//
                                | parse log /(?<url>\/service\/.*) (?<admin>.*)\|.*/
                              - | parse log "Sensitive Admin API request * " as request_type
                              - | display @timestamp, admin, url, request_type
                              - | sort request_type desc, @timestamp desc
                              + | display @timestamp, admin, url
                              + | sort @timestamp desc
                                | limit 5000
                            EOT
                            # (4 unchanged elements hidden)
                        }
                        # (5 unchanged elements hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ query   = <<-EOT
                              - SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp, log 
                              + SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp, log
                                | filter kubernetes.container_name like /admin/
                                | filter log like /Sensitive/
                                | filter log like /\/service\/[0-9a-f\-]{36}\//
                                | parse log /service\/(?<service>[0-9a-f\-]*)\/.* (?<admin>.*)\|.*/
                              - | parse log "Sensitive Admin API request * " as request_type
                              - | stats count(*) as total by service, admin, request_type
                              - | sort request_type desc, total desc
                              + | stats count(*) as total by service, admin
                              + | sort total desc
                            EOT
                          - stacked = false -> null
                            # (3 unchanged elements hidden)
                        }
                        # (5 unchanged elements hidden)
                    },
                ]
            }
        )
        id             = "Temp_admin_views_of_sensitive_services"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-send-sms-high-queue-delay-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-sms-high-queue-delay-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in send-sms-high queue >= 60 seconds for 5 minutes"
      + alarm_name                            = "sqs-send-sms-high-queue-delay-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-sms-high"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-send-sms-high-queue-delay-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-sms-high-queue-delay-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in send sms high priority queue >= 10 seconds for 3 minutes"
      + alarm_name                            = "sqs-send-sms-high-queue-delay-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-sms-high"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-send-sms-low-queue-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-sms-low-queue-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in send-sms-low queue is >= 3 hours"
      + alarm_name                            = "sqs-send-sms-low-queue-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-sms-low"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 10800
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-send-sms-low-queue-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-sms-low-queue-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in send-sms-low queue is >= 10 minutes for 5 minutes"
      + alarm_name                            = "sqs-send-sms-low-queue-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-sms-low"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 600
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-send-sms-medium-queue-delay-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-sms-medium-queue-delay-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in send-sms-medium queue is >= 15 minutes for 5 minutes"
      + alarm_name                            = "sqs-send-sms-medium-queue-delay-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-sms-medium"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 900
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-send-sms-medium-queue-delay-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-send-sms-medium-queue-delay-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in send-sms-medium queue is >= 10 minutes for 5 minutes"
      + alarm_name                            = "sqs-send-sms-medium-queue-delay-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-casend-sms-medium"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 600
      + treat_missing_data                    = "missing"
    }

  # module.athena_logs_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-production-athena-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.csv_bucket_logs.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-production-csv-upload-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.document_download_logs.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = "notification-canada-ca-production-document-download-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 49 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
